app.controller('faq', function($scope,$http) {
    
    $scope.panes = [
        {
            'header': 'ماهو دواير؟',
        'content': 'هو تطبيق يعمل علي توفير منصة تواصل بين الشركات والمطورين و بين المطورين وبعضهم في مجتمع تقني يهدف إلي تواصل أفضل وأسرع ومصداقية في المعلومات. و إتاحة عرض سيرة المطور الذاتية لإتاحة فرص العمل الحر (Freelancers) للشركات و الأفراد في المشاريع.',
            'subpanes': [
                {
                    'header': 'ماذا يقدم دواير؟',
                    'content': 'يعمل دواير علي الصعيد المهني اكثر حيث يعمل علي تحليل المعلومات الخاصة بالمطور والشركات مما يحقق توافر الفرص الحقيقية التي ترضي الطرفين.',
                }
            ]
        },
//        {
//            'header': 'ماذا يقدم دواير؟',
//            'content': 'يعمل دواير علي الصعيد المهني اكثر حيث يعمل علي تحليل المعلومات الخاصة بالمطور والشركات مما يؤدي إلي وجود فرص حقيقية ترضي الطرفين',
//        },
        {
            'header': 'لماذا تسجل في دواير؟',
            'content': 'تسجيلك في مجتمع دواير يحقق الثراء المهني و  تبادل الخبرات و المشاريع المشتركة و يرتقي بالسوق المستهدف ليحقق أفضل النتائج لكافة أعضاء دواير.',
        },
        {
            'header': 'ماهي الوظائف المقترحة؟',
            'content': 'هو جزء في حساب الأشخاص المطورين ويمكنك تفعيل هذا الجزء وضبط الاعدادات حيث يمكنك معرفة الترشيحات الأنسب  للوظائف المتاحة لك.',
        },
        {
            'header': 'كيف يمكنني إضافة وظيفة؟',
            'content': 'يمكنك إضافة وظيفة عندما تسجل حسابك كشركة في دواير حيث يمكنك تكوين ملف شخصي للشركة وعرض المشاريع السابقة واضافة أعضاء فريق العمل .. ويمكنك إضافة وظيفة الي أحد الشركات التابعة لك وبالتالي يمكنك الدخول في عملية التحليل للحصول علي الموظف الأنسب في تلك الوظيفة.',
        },
        {
            'header': 'ما الفرق بين الحساب الشخصي وحساب الشركة؟',
            'content': 'الحساب الشخصي هو حسابك انت ويمكنك تكوين حساب للشركة من خلال حسابك الخاص وبالتالي تكون الشركة تابعة لحسابك الشخصي',
        },
    ]
    
    
    $scope.$on('my-accordion:onReady', function () {
      var firstPane = $scope.panes[0];
      $scope.accordion.toggle(firstPane.id);
    });

    
});